DataProcessors/МобильноеРабочееМестоКладовщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>МобильноеРабочееМестоКладовщика</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Documents/РасходныйОрдерНаТовары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РасходныйОрдерНаТовары</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыКОтгрузке</xr:Item>
				<xr:Item>AccumulationRegister.ДвиженияСерийТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыКОтбору</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.Доставка</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВЯчейках</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВсегоМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаданиеНаПеревозку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Рейс</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаданиеНаПеревозку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаОтгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контролер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтгрузкаПоЗаданиюНаПеревозку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отгрузил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОтправительПолучательТоваров</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимПросмотраПоТоварам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладскаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СкладскиеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыРасходныхОрдеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролируемаяПартия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтролируемыеПартии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТоварыПоРаспоряжениям</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Распоряжение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.РаспоряжениеНаОтгрузку</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтгружаемыеТовары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоУпаковочныйЛист</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УпаковочныйЛистРодитель</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УпаковочныйЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УпаковочныйЛист</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УпаковочныйЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДействияСоСтрокамиОрдеровНаОтгрузку</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШтрихкодыУпаковок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ШтрихкодУпаковки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыУпаковокТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/МобильноеРабочееМестоКладовщика/Forms/ФормаВыбораСканирование/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РезультатСканирования = Параметры.РезультатСканирования; // Структура 
	Склад = Параметры.Склад;
	Помещение = Параметры.Помещение;
	Режим = РезультатСканирования.Режим;
	Штрихкод = РезультатСканирования.Штрихкод;
	
	ЗаполнитьФорму(РезультатСканирования);	
	УстановитьУсловноеОформление(РезультатСканирования);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если ИспользуемыйСерверФормы = ИспользуемыйСервер.Основной Тогда

		Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда 
			
			ЕстьНеобработанноеСобытие = МобильноеРабочееМестоКладовщикаКлиент.ЕстьНеобработанноеСобытие();
			
			Если ИмяСобытия = "ScanData" И ЕстьНеобработанноеСобытие Тогда
			
				Если Элементы.ГруппаТаблицаРаспоряженияНаОтгрузку.Видимость Тогда 
					ВыборРаспоряженияОтгрузка(РаспоряженияОтгрузка[0]);
				ИначеЕсли Элементы.ГруппаТаблицаРаспоряженияНаПриемку.Видимость Тогда
					ВыборРаспоряженияПриемка(РаспоряженияПриемка[0]);
				ИначеЕсли Элементы.ГруппаТаблицаОрдера.Видимость Тогда 
					ВыборОрдера(Ордера[0]);
				ИначеЕсли Элементы.ГруппаТаблицаЗадания.Видимость Тогда
					ВыборЗадания(Задания[0]);
				ИначеЕсли Элементы.ГруппаТаблицаНоменклатура.Видимость Тогда 
					ВыборНоменклатуры(Номенклатура[0]);
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовТаблицыФормыРаспоряженияОтгрузка

&НаКлиенте
Процедура РаспоряженияОтгрузкаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.РаспоряженияОтгрузка.ТекущиеДанные; 
	ВыборРаспоряженияОтгрузка(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспоряженияОтгрузкаПриАктивизацииСтроки(Элемент)
	
	РаспоряженияОтгрузка[0].Выбор = Ложь;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРаспоряженияПриемка

&НаКлиенте
Процедура РаспоряженияПриемкаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.РаспоряженияПриемка.ТекущиеДанные; 
	ВыборРаспоряженияПриемка(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспоряженияПриемкаПриАктивизацииСтроки(Элемент)

	РаспоряженияПриемка[0].Выбор = Ложь;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОрдера

&НаКлиенте
Процедура ОрдераВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	
	ТекущаяСтрока = Элементы.Ордера.ТекущиеДанные;
	ВыборОрдера(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрдераПриАктивизацииСтроки(Элемент)
	
	Ордера[0].Выбор = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗадания

&НаКлиенте
Процедура ЗаданияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.Задания.ТекущиеДанные;  
	ВыборЗадания(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаданияПриАктивизацииСтроки(Элемент)

	Задания[0].Выбор = Ложь;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНоменклатура

&НаКлиенте
Процедура НоменклатураВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.Номенклатура.ТекущиеДанные;  
	ВыборНоменклатуры(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриАктивизацииСтроки(Элемент)

	Номенклатура[0].Выбор = Ложь;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьРазмещение(Команда)
	
	РезультатПоиска = РезультатПоискаДокументаПоШК();	
	Закрыть(РезультатПоиска);
	
КонецПроцедуры

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыборРаспоряженияОтгрузка(ТекущаяСтрока)
			
	РезультатПоиска = РезультатПоискаДокументаПоШК();
	РезультатПоиска.ЭтоРаспоряжение = Истина; 
	РезультатПоиска.Направление = "Отгрузка";
	РезультатПоиска.Штрихкод = Штрихкод;
	
	ДанныеРаспоряжение = Новый Структура("Распоряжение, Получатель, Номер");
	ДанныеРаспоряжение.Вставить("ТипДокумента");
	ЗаполнитьЗначенияСвойств(ДанныеРаспоряжение, ТекущаяСтрока); 
	РезультатПоиска.Ссылки = МобильноеРабочееМестоКладовщикаКлиентСервер.ЗначениеВМассиве(ДанныеРаспоряжение);
	
	ОрдераПоРаспоряжениям = Новый Массив;
	Если Режим = "ПоискДокумента" Тогда

		ОрдераПоРаспоряжениям = ОрдераПоРаспоряжениям(ТекущаяСтрока.Распоряжение, Истина, Ложь);
		
		Если ОрдераПоРаспоряжениям.Ссылки.Количество() Тогда
			Закрыть(ОрдераПоРаспоряжениям);
		Иначе
			Закрыть(РезультатПоиска);
		КонецЕсли;
		
	ИначеЕсли Режим = "ВыборДокумента" Тогда
		
		Закрыть(РезультатПоиска);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборРаспоряженияПриемка(ТекущаяСтрока)
		
	РезультатПоиска = РезультатПоискаДокументаПоШК();
	РезультатПоиска.ЭтоРаспоряжение = Истина; 
	РезультатПоиска.Направление = "Приемка";
	РезультатПоиска.Штрихкод = Штрихкод;
	
	РезультатПоиска.Ссылки = МобильноеРабочееМестоКладовщикаКлиентСервер.ЗначениеВМассиве(ТекущаяСтрока);
	
	ОрдераПоРаспоряжениям = Новый Массив;
	Если Режим = "ПоискДокумента" Тогда

		ОрдераПоРаспоряжениям = ОрдераПоРаспоряжениям(ТекущаяСтрока.Распоряжение, Ложь, Истина);
		
		Если ОрдераПоРаспоряжениям.Ссылки.Количество() Тогда
			Закрыть(ОрдераПоРаспоряжениям);
		Иначе
			Закрыть(РезультатПоиска);
		КонецЕсли;
		
	ИначеЕсли Режим = "ВыборДокумента" Тогда
			
		Закрыть(РезультатПоиска);
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборОрдера(ТекущаяСтрока)
		
	РезультатПоиска = РезультатПоискаДокументаПоШК();
	
	РезультатПоиска.ЭтоРаспоряжение = Ложь;
	РезультатПоиска.Ссылки = МобильноеРабочееМестоКладовщикаКлиентСервер.ЗначениеВМассиве(ТекущаяСтрока.Ссылка);
	РезультатПоиска.Штрихкод = Штрихкод;
	
	Закрыть(РезультатПоиска);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборЗадания(ТекущаяСтрока)
		
	РезультатПоиска = РезультатПоискаДокументаПоШК();
	
	РезультатПоиска.ЭтоРаспоряжение = Ложь;	
	РезультатПоиска.Ссылки = МобильноеРабочееМестоКладовщикаКлиентСервер.ЗначениеВМассиве(ТекущаяСтрока.Ссылка);
	
	Закрыть(РезультатПоиска);
	
КонецПроцедуры 

&НаКлиенте
Процедура ВыборНоменклатуры(ТекущаяСтрока)
	
	ДанныеТовара = МобильноеРабочееМестоКладовщикаКлиентСервер.ЗначениеВМассиве(ТекущаяСтрока);

	Закрыть(ДанныеТовара);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление(РезультатСканирования)
	
	Если Режим = "ПоискДокумента" Или РезультатСканирования.Режим = "ВыборДокумента" Тогда
 
		Если РезультатСканирования.ЭтоРаспоряжение Тогда 
			
			Заголовок = НСтр("ru = 'Выберите распоряжение'");

			Если РезультатСканирования.Направление = "Отгрузка" Тогда
				
				Элементы.ГруппаТаблицаРаспоряженияНаОтгрузку.Видимость = Истина; 
				Элементы.ГруппаПолучатель.Видимость = Истина; 
				
				ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
				ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
				ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаспоряженияОтгрузка.Имя);
				ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("РаспоряженияОтгрузка.Выбор");
				ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
				ОтборЭлемента.ПравоеЗначение = Истина;
				ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветАктивности); 
				
				ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
				ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
				ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаспоряженияОтгрузкаСостояние.Имя);
				ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("РаспоряженияОтгрузка.СостояниеОтгрузки");
				ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
				ОтборЭлемента.ПравоеЗначение = 2;
				ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ОбычныйШрифтТекстаМРМК);
				ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаДополнительныйСборкаИДоставка);
			Иначе
				// Распоряжения - приемка
				Элементы.ГруппаТаблицаРаспоряженияНаПриемку.Видимость = Истина;
				Элементы.ГруппаОтправитель.Видимость = Истина;
				
				ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
				ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
				ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаспоряженияПриемка.Имя);
				ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("РаспоряженияПриемка.Выбор");
				ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
				ОтборЭлемента.ПравоеЗначение = Истина;
				ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветАктивности);
				
				ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
				ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
				ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаспоряженияПриемка.Имя);
				ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("РаспоряженияПриемка.Состояние");
				ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
				ОтборЭлемента.ПравоеЗначение = 3;
				ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ОбычныйШрифтТекстаМРМК);
				ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаДополнительныйСборкаИДоставка);
				
			КонецЕсли;
			
		ИначеЕсли Режим = "ПоискДокумента" Тогда
			
			Элементы.ГруппаРаспоряжение.Видимость = Истина;
			Элементы.ГруппаТаблицаОрдера.Видимость = Истина; 
			
			СвойстваСклада = Обработки.МобильноеРабочееМестоКладовщика.СвойстваСклада(Склад);
			Элементы.ГруппаПомещениеОрдера.Видимость = СвойстваСклада.ИспользоватьСкладскиеПомещения;
			
			ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
			ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Ордера.Имя);
			ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ордера.Выбор");
			ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ОтборЭлемента.ПравоеЗначение = Истина;
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветАктивности); 
				
			ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
			ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОрдераСтатус.Имя);
			ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ордера.СтатусОтгрузкиПриемки");
			ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
			ОтборЭлемента.ПравоеЗначение = 2;
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ОбычныйШрифтТекстаМРМК);
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаДополнительныйСборкаИДоставка);
			
			ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
			ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОрдераИсполнитель.Имя);
			ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ордера.ОрдераИсполнитель");
			ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<не назначен>'"));

			Если РезультатСканирования.Направление = "Двухсторонний" Тогда
				
				Заголовок = НСтр("ru = 'Выберите ордер'");
				Элементы.ГруппаОтправительПолучатель.Видимость = Истина;
				Элементы.ОрдераТипДокумента.Видимость = Истина;

			ИначеЕсли РезультатСканирования.Направление = "Отгрузка" Тогда
				
				Заголовок = НСтр("ru = 'Выберите расходный ордер'");
				Элементы.ГруппаПолучатель.Видимость = Истина; 
				
			ИначеЕсли РезультатСканирования.Направление = "Приемка" Тогда
				
				Заголовок = НСтр("ru = 'Выберите приходный ордер'"); 
				Элементы.ГруппаОтправитель.Видимость = Истина; 
				
			КонецЕсли;
			
		ИначеЕсли РезультатСканирования.Режим = "ВыборДокумента" Тогда
			
			Элементы.ГруппаПомещение.Видимость = Истина; 
			Элементы.ГруппаТаблицаЗадания.Видимость = Истина; 
			
			ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
			ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Задания.Имя);
			ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Задания.Выбор");
			ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ОтборЭлемента.ПравоеЗначение = Истина;
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветАктивности); 
				
			ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
			ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗаданияСтатус.Имя);
			ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Задания.СтатусЗадания");
			ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
			ОтборЭлемента.ПравоеЗначение = 2;
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ОбычныйШрифтТекстаМРМК);
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаДополнительныйСборкаИДоставка);
			
			ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
			ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗаданияИсполнитель.Имя);
			ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Задания.ЗаданияИсполнитель");
			ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<не назначен>'"));

			Если РезультатСканирования.Направление = "Отгрузка" Тогда 
				Заголовок = НСтр("ru = 'Выберите задание на отбор'");
				Элементы.ГруппаЗонаОтгрузки.Видимость = Истина; 
			Иначе
				Заголовок = НСтр("ru = 'Выберите задание на размещение'");
				Элементы.ГруппаЗонаПриемки.Видимость = Истина; 
				Элементы.ДекорацияОтступ.Видимость = Ложь;
				Элементы.ДекорацияВыборРазмещения.Видимость = Истина; 
				Если ИспользуемыйСерверФормы = ИспользуемыйСервер.Основной Тогда
					Элементы.СоздатьРазмещение.Видимость = Истина;
				КонецЕсли;
			КонецЕсли;

		КонецЕсли; 
		
	ИначеЕсли Режим = "ВыборНоменклатуры" Тогда
		
		Элементы.ГруппаТаблицаНоменклатура.Видимость = Истина;
		
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Номенклатура.Имя);
		ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура.Выбор");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина;
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветАктивности); 
		
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.НоменклатураХарактеристика.Имя);
		ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура.Характеристика");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<характеристика не указана>'"));
		
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.НоменклатураСерия.Имя);
		ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура.Серия");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<серия не указана>'"));		
		
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.НоменклатураУпаковка.Имя);
		ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура.Упаковка");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<упаковка не указана>'"));

		Заголовок = НСтр("ru = 'Выберите номенклатуру'");
		Элементы.ГруппаШапка.Видимость = Ложь; 
			
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФорму(РезультатСканирования)
	
	Если Режим = "ПоискДокумента" Или РезультатСканирования.Режим = "ВыборДокумента" Тогда
		
		Если РезультатСканирования.ЭтоРаспоряжение Тогда
					
			Если РезультатСканирования.Направление = "Отгрузка" Тогда
				
				Для Каждого Распоряжение Из РезультатСканирования.Ссылки Цикл
					НоваяСтрока = РаспоряженияОтгрузка.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Распоряжение);
					НоваяСтрока.КартинкаШтрихкод = 1;
				КонецЦикла; 
				
				РаспоряженияОтгрузка.Сортировать("СостояниеОтгрузки");
				
				Элементы.Получатель.Заголовок = РаспоряженияОтгрузка[0].Получатель;
				РаспоряженияОтгрузка[0].Выбор = Истина;
				РаспоряженияОтгрузка[0].КартинкаШтрихкод = 0;

			Иначе
				Для Каждого Распоряжение Из РезультатСканирования.Ссылки Цикл
					НоваяСтрока = РаспоряженияПриемка.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Распоряжение);
					НоваяСтрока.КартинкаШтрихкод = 1;
				КонецЦикла;
				
				РаспоряженияПриемка.Сортировать("Состояние");
				
				Элементы.Отправитель.Заголовок = РаспоряженияПриемка[0].Отправитель; 
				РаспоряженияПриемка[0].Выбор = Истина;
				РаспоряженияПриемка[0].КартинкаШтрихкод = 0;

			КонецЕсли;
			
		ИначеЕсли Режим = "ПоискДокумента" Тогда		
			
			Запрос = Новый Запрос; 
			
			Если РезультатСканирования.Направление = "Двухсторонний" Тогда 
				
				СсылкиРасходныеОрдера = Новый Массив;
				СсылкиПриходныеОрдера = Новый Массив;
				
				Для Каждого Ордер Из РезультатСканирования.Ссылки Цикл
					Если ТипЗнч(Ордер) = Тип("ДокументСсылка.РасходныйОрдерНаТовары") Тогда 
						СсылкиРасходныеОрдера.Добавить(Ордер);
					Иначе
						СсылкиПриходныеОрдера.Добавить(Ордер);
					КонецЕсли;
				КонецЦикла;
				
				Запрос.Текст = ТекстЗапросаРасходныеОрдера();
				Запрос.УстановитьПараметр("Ссылки", СсылкиРасходныеОрдера);

				РезультатРасходныеОрдера = Запрос.Выполнить().Выгрузить();
				РезультатРасходныеОрдера.Сортировать("СтатусОтгрузкиПриемки");
						
				Запрос.Текст = ТекстЗапросаПриходныеОрдера();
				Запрос.УстановитьПараметр("Ссылки", СсылкиПриходныеОрдера);

				РезультатПриходныеОрдера = Запрос.Выполнить().Выгрузить();
				РезультатПриходныеОрдера.Сортировать("СтатусОтгрузкиПриемки"); 
				
				МобильноеРабочееМестоКладовщикаКлиентСервер.ДополнитьТаблицу(РезультатПриходныеОрдера, РезультатРасходныеОрдера);
				Ордера.Загрузить(РезультатРасходныеОрдера);
				
			Иначе
				Запрос.УстановитьПараметр("Ссылки", РезультатСканирования.Ссылки);
				
				Если РезультатСканирования.Направление = "Отгрузка" Тогда
					Запрос.Текст = ТекстЗапросаРасходныеОрдера();
				Иначе
					Запрос.Текст = ТекстЗапросаПриходныеОрдера();
				КонецЕсли;
				
				РезультатЗапроса = Запрос.Выполнить().Выгрузить();
				
				РезультатЗапроса.Сортировать("СтатусОтгрузкиПриемки");
				Ордера.Загрузить(РезультатЗапроса);

			КонецЕсли; 
			
			Распоряжение = РезультатСканирования.Распоряжение;
			ИнформацияОРаспоряжении = МобильноеРабочееМестоКладовщика.ЗначенияРеквизитовОбъекта(Распоряжение, "Номер, Дата");	
			ДатаРаспоряжения = Формат(ИнформацияОРаспоряжении.Дата, НСтр("ru = 'ДЛФ=D'"));
			
			СтрокаОРаспоряжении = СтрШаблон(НСтр("ru = '%1, %2, %3'"), ТипЗнч(Распоряжение), ИнформацияОРаспоряжении.Номер,
				ДатаРаспоряжения);
			Элементы.Распоряжение.Заголовок = СтрокаОРаспоряжении;	
			
			Склад = Ордера[0].Склад;
			Элементы.Получатель.Заголовок = Ордера[0].ОтправительПолучатель;
			Элементы.Отправитель.Заголовок = Ордера[0].ОтправительПолучатель;
			Элементы.ОтправительПолучатель.Заголовок = Ордера[0].ОтправительПолучатель;
			
			Ордера[0].Выбор = Истина;
			Ордера[0].КартинкаШтрихкод = 0;
			
		ИначеЕсли Режим = "ВыборДокумента" Тогда
			
			Для Каждого Задание Из РезультатСканирования.Ссылки Цикл
				НоваяСтрока = Задания.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Задание);
				НоваяСтрока.КартинкаШтрихкод = 1;
			КонецЦикла; 
				
			Задания.Сортировать("СтатусЗадания");
			
			Задания[0].Выбор = Истина;
			Задания[0].КартинкаШтрихкод = 0;

		КонецЕсли;
		
		Элементы.Склад.Заголовок = Склад;
		
	ИначеЕсли Режим = "ВыборНоменклатуры" Тогда
		
		Для Каждого Товар Из РезультатСканирования.Товары Цикл
			НоваяСтрока = Номенклатура.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Товар);
			НоваяСтрока.КартинкаШтрихкод = 1;
		КонецЦикла; 
		
		Номенклатура[0].Выбор = Истина;
		Номенклатура[0].КартинкаШтрихкод = 0; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ТекстЗапросаРасходныеОрдера()
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	РасходныйОрдерНаТовары.Ссылка КАК Ссылка,
		|	ТИПЗНАЧЕНИЯ(РасходныйОрдерНаТовары.Ссылка) КАК ТипДокумента,
		|	РасходныйОрдерНаТовары.Помещение КАК Помещение,
		|	СТРОКА(""Помещение"") КАК ПомещениеЗаголовок,
		|	РасходныйОрдерНаТовары.Получатель КАК ОтправительПолучатель,
		|	РасходныйОрдерНаТовары.Номер КАК Номер,
		|	РасходныйОрдерНаТовары.Дата КАК Дата,
		|	РасходныйОрдерНаТовары.Статус КАК Статус,
		|	РасходныйОрдерНаТовары.Склад КАК Склад,
		|	1 КАК КартинкаШтрихкод,
		|	ВЫБОР
		|		КОГДА РасходныйОрдерНаТовары.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.Подготовлен)
		|			ТОГДА 0
		|		КОГДА РасходныйОрдерНаТовары.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.КОтбору)
		|			ТОГДА 1
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК СтатусОтгрузкиПриемки,
		|	ВЫБОР
		|		КОГДА РасходныйОрдерНаТовары.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.Подготовлен)
		|			ИЛИ РасходныйОрдерНаТовары.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.КОтбору)
		|			ИЛИ РасходныйОрдерНаТовары.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.КПроверке)
		|			ТОГДА РасходныйОрдерНаТовары.Ответственный
		|		КОГДА РасходныйОрдерНаТовары.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.ВПроцессеПроверки)
		|			ИЛИ РасходныйОрдерНаТовары.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.Проверен)
		|			ТОГДА РасходныйОрдерНаТовары.Контролер
		|		ИНАЧЕ РасходныйОрдерНаТовары.Отгрузил
		|	КОНЕЦ КАК Исполнитель,
		|	ВЫБОР
		|		КОГДА РасходныйОрдерНаТовары.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.Подготовлен)
		|			ИЛИ РасходныйОрдерНаТовары.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.КОтбору)
		|			ИЛИ РасходныйОрдерНаТовары.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.КПроверке)
		|			ТОГДА СТРОКА(""Исполнитель"")
		|		КОГДА РасходныйОрдерНаТовары.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.ВПроцессеПроверки)
		|			ИЛИ РасходныйОрдерНаТовары.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.Проверен)
		|			ТОГДА СТРОКА(""Контролер"")
		|		ИНАЧЕ СТРОКА(""Отгрузил"")
		|	КОНЕЦ КАК ИсполнительЗаголовок
		|ИЗ
		|	Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
		|ГДЕ
		|	РасходныйОрдерНаТовары.Ссылка В (&Ссылки)"; 
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Функция ТекстЗапросаПриходныеОрдера()
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ПриходныйОрдерНаТовары.Ссылка КАК Ссылка,
		|	ТИПЗНАЧЕНИЯ(ПриходныйОрдерНаТовары.Ссылка) КАК ТипДокумента,
		|	ПриходныйОрдерНаТовары.Помещение КАК Помещение,
		|	СТРОКА(""Помещение"") КАК ПомещениеЗаголовок,
		|	ПриходныйОрдерНаТовары.Отправитель КАК ОтправительПолучатель,
		|	ПриходныйОрдерНаТовары.Номер КАК Номер,
		|	ПриходныйОрдерНаТовары.Дата КАК Дата,
		|	ПриходныйОрдерНаТовары.Статус КАК Статус,
		|	ПриходныйОрдерНаТовары.Склад КАК Склад,
		|	1 КАК КартинкаШтрихкод,
		|	ВЫБОР
		|		КОГДА ПриходныйОрдерНаТовары.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПриходныхОрдеров.КПоступлению)
		|			ТОГДА 0
		|		КОГДА ПриходныйОрдерНаТовары.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПриходныхОрдеров.ВРаботе)
		|			ТОГДА 1
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК СтатусОтгрузкиПриемки,
		|	ПриходныйОрдерНаТовары.Исполнитель КАК Исполнитель,
		|	СТРОКА(""Исполнитель"") КАК ИсполнительЗаголовок
		|ИЗ
		|	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
		|ГДЕ
		|	ПриходныйОрдерНаТовары.Ссылка В (&Ссылки)";
	
	Возврат ТекстЗапроса;

КонецФункции

&НаСервере
Функция ОрдераПоРаспоряжениям(Знач Распоряжение, Знач ЭтоОтгрузка, Знач ЭтоПриемка)
	
    ОрдераПоРаспоряжениям =  Обработки.МобильноеРабочееМестоКладовщика.ОрдераПоРаспоряжениям(Распоряжение, Склад, ЭтоОтгрузка, ЭтоПриемка);
	
	РезультатПоиска = РезультатПоискаДокументаПоШК();
	РезультатПоиска.ЭтоРаспоряжение = Ложь;
	РезультатПоиска.Ссылки = ОрдераПоРаспоряжениям.СсылкиНаОрдера; 
	РезультатПоиска.Распоряжение = Распоряжение;
	РезультатПоиска.Направление = ОрдераПоРаспоряжениям.НаправлениеОрдеров; 
	РезультатПоиска.Режим = Режим;
	РезультатПоиска.Штрихкод = Штрихкод;
	
	Возврат РезультатПоиска;
	
КонецФункции

&НаСервере
Функция РезультатПоискаДокументаПоШК()
		
	РезультатПоиска = Обработки.МобильноеРабочееМестоКладовщика.РезультатПоискаДокументаПоШК();
	
	Возврат РезультатПоиска;
	
КонецФункции
	
#КонецОбласти
